<?php
    $rf["Краснодарский край"] = ["Краснодар", "Полтавская", "Староминская"];
    $rf["Ростовская область"] = ["Ростов-на-Дону", "Аксай", "Азов"];
    $rf["Ставропольский край"] = ["Ставрополь", "Ессентуки", "Пятигорск"];
    foreach ($rf as $key => $item1) {
        echo '<br>' . $key . ": ";
        foreach ($item1 as $item2) {
            echo "$item2";
            $x = count($item1);
            if ($item2 == $item1[$x-1]) {
                echo ".";
            } else {
                echo ", ";
            }
        }
    }
?>